Repository: terrylinwkMGS/Global-payment-source-code-tiral
Catalog: languages/globalpayments-gateway-provider-for-woocommerce-*.po
Languages: fr_fr

source: This extension allows WooCommerce to use the available Global Payments payment gateways. All card data is tokenized using the respective gateway's tokenization service.
fr_fr: Ce module d'extension permet à WooCommerce d'utiliser les passerelles de paiement Global Payments disponibles. Pour toutes les données de cartes, des jetons sont créés à l'aide du service de création de jetons de la passerelle utilisée.

source: Pay for Order
fr_fr: Payer la commande

source: This order has a transaction ID associated with it already. Click the checkbox to proceed.
fr_fr: Cette commande est déjà associée à un ID transaction. Cochez la case pour continuer.

source: Ok to process order
fr_fr: Ok pour traiter la commande

source: Pay
fr_fr: Payer

source: View Transaction Info
fr_fr: Afficher les informations sur les transactions

source: Admins can view transaction details using this functionality.
fr_fr: Les administrateurs peuvent afficher les détails des transactions à l'aide de cette fonctionnalité.

source: General Info
fr_fr: Informations générales

source: Transaction Status
fr_fr: Statut de transaction

source: Transaction Type
fr_fr: Type de transaction

source: Amount
fr_fr: Montant

source: Currency
fr_fr: Devise

source: Provider
fr_fr: Fournisseur

source: Payment Type
fr_fr: Type de paiement

source: This page is currently in sandbox/test mode. Do not use real/active card numbers.
fr_fr: Cette page est actuellement en mode test. Ne pas utiliser de numéros de carte réels/actifs.

source: Enable/Disable
fr_fr: Activer/Désactiver

source: Enable Gateway
fr_fr: Activer la passerelle

source: Title
fr_fr: Titre

source: This controls the title which the user sees during checkout.
fr_fr: Cela contrôle le titre que voit l'utilisateur durant le paiement.

source: Credit Card
fr_fr: Carte de crédit

source: Payment Action
fr_fr: Action de paiement

source: Choose whether you wish to capture funds immediately or authorize payment only for a delayed capture.
fr_fr: Choisissez de capturer les fonds immédiatement ou d'autoriser le paiement seulement et de retarder la capture.

source: Authorize + Capture
fr_fr: Autoriser + Capturer

source: Authorize only
fr_fr: Autoriser seulement

source: Allow Card Saving
fr_fr: Permettre la sauvegarde de carte

source: Note: to use the card saving feature, you must have multi-use token support enabled on your account. Please contact <a href="mailto:%s?Subject=WooCommerce%%20Card%%20Saving%%20Option">support</a> with any questions regarding this option.
fr_fr: Remarque : Pour utiliser la fonction de sauvegarde de carte, vous devez activer la prise en charge de jetons à multiples usages dans votre compte. Veuillez contacter le <a href="mailto:%s?Subject=WooCommerce%%20Card%%20Saving%%20Option">Soutien</a> si vous avez des questions sur cette option.

source: Order Transaction Descriptor
fr_fr: Descripteur de transaction de commande

source: During a Capture or Authorize payment action, this value will be passed along as the transaction-specific descriptor listed on the customer's bank account. Please contact <a href="mailto:%s?Subject=WooCommerce%%20Transaction%%20Descriptor%%20Option">support</a> with any questions regarding this option (maxLength: 25).
fr_fr: Lors d'une capture ou d'une autorisation de paiement, cette valeur sera transmise en tant que descripteur de transaction énoncé dans le compte bancaire du client. Veuillez contacter le <a href="mailto:%s?Subject=WooCommerce%%20Transaction%%20Descriptor%%20Option">Soutien</a> si vous avez des questions sur cette option (longueur max : 25).

source: Check AVS CVN
fr_fr: Vérifier AVS CVN

source: Check AVS/CVN result codes and reverse transaction.
fr_fr: Vérifier les codes de résultat AVS/CVN et annuler la transaction.

source: This will check AVS/CVN result codes and reverse transaction.
fr_fr: Cela amorcera une vérification des codes de résultat AVS/CVN et annulera la transaction.

source: AVS Reject Conditions
fr_fr: Conditions de rejet AVS

source: Choose for which AVS result codes, the transaction must be auto reversed.
fr_fr: Choisissez les codes de résultat AVS qui entraîneront une annulation automatique de la transaction.

source: CVN Reject Conditions
fr_fr: Conditions de rejet CVN

source: Choose for which CVN result codes, the transaction must be auto reversed.
fr_fr: Choisissez les codes de résultat CVN qui entraîneront une annulation automatique de la transaction.

source: Credit Card Number
fr_fr: Numéro de carte de crédit

source: Please enter a valid Credit Card Number
fr_fr: Veuillez entrer un numéro de carte de crédit valide

source: Credit Card Expiration Date
fr_fr: Date d'expiration de la carte de crédit

source: MM / YYYY
fr_fr: MM / AAAA

source: Please enter a valid Credit Card Expiration Date
fr_fr: Veuillez entrer une date d'expiration de carte de crédit valide

source: Credit Card Security Code
fr_fr: Code de sécurité de la carte de crédit

source: Please enter a valid Credit Card Security Code
fr_fr: Veuillez entrer un code de sécurité de carte de crédit valide

source: Order created with Transaction ID: %s
fr_fr: Commande créée avec l'ID de transaction : %s

source: authorized
fr_fr: autorisé

source: charged
fr_fr: chargé

source: Refund amount must be a valid number
fr_fr: Le montant de remboursement doit être un numéro valide

source: Refund amount must be greater than zero.
fr_fr: Le montant de remboursement doit être supérieur à zéro.

source: %s%s was reversed or refunded. Transaction ID: %s
fr_fr: %s%s a été annulé ou remboursé. ID de transaction : %s

source: Transaction captured. Transaction ID for the capture: %s
fr_fr: Transaction capturée. ID de transaction pour la capture : %s

source: Capture credit card authorization
fr_fr: Capturer l'autorisation de carte de crédit

source: A - Address matches, zip No Match
fr_fr: A - Adresse correspond, code postal ne correspond pas

source: N - Neither address or zip code match
fr_fr: N - Adresse et code postal ne correspondent pas

source: R - Retry - system unable to respond
fr_fr: R - Réessayer - système incapable de répondre

source: U - Visa / Discover card AVS not supported
fr_fr: U - AVS de carte Visa/Discover non pris en charge

source: S - Master / Amex card AVS not supported
fr_fr: S - AVS de carte Master/Amex non pris en charge

source: Z - Visa / Discover card 9-digit zip code match, address no match
fr_fr: Z - Code postal de 9 chiffres de carte Visa/Discover correspond, adresse ne correspond pas

source: W - Master / Amex card 9-digit zip code match, address no match
fr_fr: W - Code postal de 9 chiffres de carte Master/Amex correspond, adresse ne correspond pas

source: Y - Visa / Discover card 5-digit zip code and address match
fr_fr: Y - Code postal de 5 chiffres et adresse de carte Visa/Discover correspondent

source: X - Master / Amex card 5-digit zip code and address match
fr_fr: X - Code postal de 5 chiffres et adresse de carte Master/Amex correspondent

source: G - Address not verified for International transaction
fr_fr: G - Adresse non vérifiée pour transaction internationale

source: B - Address match, Zip not verified
fr_fr: B - Adresse correspond, code postal non vérifié

source: C - Address and zip mismatch
fr_fr: C - Adresse et code postal ne concordent pas

source: D - Address and zip match
fr_fr: D - Adresse et code postal concordent

source: I - AVS not verified for International transaction
fr_fr: I - AVS non vérifié pour transaction internationale

source: M - Street address and postal code matches
fr_fr: M - Adresse postale et code postal concordent

source: P - Address and Zip not verified
fr_fr: P - Adresse et code postal non vérifiés

source: N - Not Matching
fr_fr: N - Ne correspond pas

source: P - Not Processed
fr_fr: P - Non Traité

source: S - Result not present
fr_fr: S - Résultat non présenté

source: U - Issuer not certified
fr_fr: U - Émetteur non certifié

source: ? - CVV unrecognized
fr_fr: ? - CVV inconnu

source: You can enable only one GlobalPayments gateway at a time. Please disable %s first!
fr_fr: Vous ne pouvez activer qu’une seule passerelle GlobalPayments à la fois. Veuillez d'abord désactiver %s!

source: Unable to perform request.
fr_fr: Impossible d'exécuter la demande.

source: 3DS Authentication failed. Please try again.
fr_fr: Échec de l'authentification 3DS. Veuillez réessayer.

source: Connect to the TSYS Genius gateway
fr_fr: Connectez-vous à la passerelle TSYS Genius

source: Live Mode
fr_fr: Mode En ligne

source: Get your credentials from your TSYS Genius account.
fr_fr: Obtenez vos informations d'identification depuis votre compte TSYS Genius.

source: Live Merchant Name
fr_fr: Nom du marchand En ligne

source: Live Merchant Site ID
fr_fr: ID du site marchand En ligne

source: Live Merchant Key
fr_fr: Clé du marchand En ligne

source: Live Web API Key
fr_fr: Clé API Web En ligne

source: Sandbox Merchant Name
fr_fr: Nom du marchand Test

source: Sandbox Merchant Site ID
fr_fr: ID du site marchand Test

source: Sandbox Merchant Key
fr_fr: Clé du marchand Test

source: Sandbox Web API Key
fr_fr: Clé API Web Test

source: Connect to the Unified Payments Gateway
fr_fr: Connectez-vous à la passerelle Unified Payments

source: Get your App Id and App Key from your <a href="https://developer.globalpay.com/user/register" target="_blank">Global Payments Developer Account</a>. Please follow the instructions provided in the <a href="https://wordpress.org/plugins/global-payments-woocommerce/" target="_blank">plugin description</a>.<br/>When you are ready for Live, please contact <a href="mailto:%s?Subject=WooCommerce%%20Live%%20Credentials">support</a> to get you live credentials.
fr_fr: Obtenez votre ID d'appli et votre clé d'appli de votre <a href="https://developer.globalpay.com/user/register" target="_blank">compte de développeur Global Payments</a>. Veuillez suivre les instructions fournies dans le <a href="https://wordpress.org/plugins/global-payments-woocommerce/" target="_blank">description du plugin</a>.<br/>Pour passer en mode En ligne, veuillez contacter le <a href="mailto:%s?Subject=WooCommerce%%20Live%%20Credentials">Soutien</a> pour obtenir vos identifiants.

source: Live App Id*
fr_fr: App ID En ligne*

source: Live App Key*
fr_fr: App Key En ligne*

source: Sandbox App Id*
fr_fr: App ID Test*

source: Sandbox App Key*
fr_fr: App Key Test*

source: Credentials check
fr_fr: Vérification des identifiants

source: Note: The Payment Methods will not be displayed at checkout if the credentials are not correct.
fr_fr: Veuillez noter que les méthodes de paiement n'apparaîtront pas lors du paiement si les identifiants sont incorrects.

source: General Settings
fr_fr: Paramètres généraux

source: Enable Logging
fr_fr: Activer l'enregistrement

source: Log all requests to and from the gateway. This can also log private data and should only be enabled in a development or stage environment.
fr_fr: Enregistrer toutes les demandes entrantes et sortantes de la passerelle. Les données privées peuvent également être enregistrées. Cela ne peut être activé que dans un environnement de développement.

source: Invalid MultiPass User ID or Password. Please try again.
fr_fr: ID utilisateur ou mot de passe MultiPass invalide. Veuillez réessayer.

source: Contact Url*
fr_fr: URL de contact*

source: A link to an About or Contact page on your website with customer care information (maxLength: 256).
fr_fr: Un lien vers une page À propos ou Contact sur votre site Web avec les informations de service à la clientèle (longueur max : 256).

source: Enable 3D Secure
fr_fr: Activer 3D Secure

source: Card Holder Name
fr_fr: Nom du détenteur de carte

source: Please enter a valid Card Holder Name
fr_fr: Veuillez entrer un nom de détenteur de carte valide

source: Please provide Live Credentials.
fr_fr: Veuillez fournir des identifiants En ligne.

source: Please provide Sandbox Credentials.
fr_fr: Veuillez fournir des identifiants Test.

source: Transaction API
fr_fr: API de transactions

source: Connect to the Transaction API
fr_fr: Connectez-vous à l'API Transaction

source: Live Public Key
fr_fr: Clé publique En ligne

source: Live API Key
fr_fr: API Key En ligne

source: Live API Secret
fr_fr: Secret API En ligne

source: Live Account Credential
fr_fr: En ligne identifiant du compte

source: Sandbox Public Key
fr_fr: Clé publique Test

source: Sandbox API Key
fr_fr: API Key Test

source: Sandbox API Secret
fr_fr: Secret API Test

source: Sandbox Account Credential
fr_fr: Identifiant du compte Test

source: Region
fr_fr: Région

source: Connect to the Heartland Portico gateway
fr_fr: Connectez-vous à la passerelle Heartland Portico

source: Get your API keys from your Heartland Online Payments account.
fr_fr: Obtenez vos clés API depuis votre compte Heartland Online Payments.

source: Live Secret Key
fr_fr: Clé secrète En ligne

source: Sandbox Secret Key
fr_fr: Clé secrète Test

source: Enable Gift Cards
fr_fr: Activer les cartes cadeaux

source: Allow customers to use gift cards to pay for purchases in full or in part.
fr_fr: Permettez aux clients d’utiliser des cartes-cadeaux pour payer leurs achats en totalité ou en partie.

source: This will display a gift card entry field directly below the credit card entry area.
fr_fr: Cela affichera un champ de saisie de la carte-cadeau directement sous la zone de saisie de la carte de crédit.

source: Your order
fr_fr: Votre commande

source: Not enough data to perform 3DS. Unable to retrieve token.
fr_fr: Pas assez de données pour réaliser 3DS. Impossible de récupérer le jeton.

source: Please try again with another card.
fr_fr: Veuillez réessayer avec une autre carte.

source: Invalid check api credentials request.
fr_fr: Demande de vérification d'identifiants API invalide.

source: App Id or App Key fields are invalid
fr_fr: Les champs App ID ou App Key sont invalides

source: Your credentials were successfully confirmed!
fr_fr: Vos identifiants ont été confirmés avec succès!

source: Unable to perform request. Invalid data.
fr_fr: Impossible d'exécuter la demande. Données invalides.

source: Invalid payment request.
fr_fr: Demande de paiement invalide.

source: Invalid amount. Order total must be greater than zero.
fr_fr: Montant invalide. Le total de la commande doit être supérieur à zéro.

source: This order has a transaction ID associated with it already. Please click the checkbox to proceed with payment.
fr_fr: Cette commande est déjà associée à un ID de transaction. Veuillez cocher la case pour effectuer le paiement.

source: Something went wrong while processing the payment.
fr_fr: Une erreur s'est produite lors du traitement du paiement.

source: Invalid view transaction request.
fr_fr: Demande d'affichage de transaction invalide.

source: Invalid transaction id.
fr_fr: ID de transaction invalide.

source: Connect to the TSYS TransIT gateway with TSEP
fr_fr: Connectez-vous à la passerelle TSYS TransIT avec TSEP

source: Get your API keys from your TSYS TransIT account.
fr_fr: Obtenez vos clés API depuis votre compte TSYS TransIT.

source: Live Merchant ID
fr_fr: ID de marchand En ligne

source: Live MultiPass User ID
fr_fr: ID utilisateur En ligne MultiPass

source: Live Password
fr_fr: Mot de passe En ligne

source: Live Device ID
fr_fr: ID d'appareil En ligne

source: Live TSEP Device ID
fr_fr: ID d'appareil TSEP En ligne

source: Live Transaction Key
fr_fr: Transaction Key En ligne

source: Sandbox Merchant ID
fr_fr: ID de marchand Test

source: Sandbox MultiPass User ID
fr_fr: ID utilisateur Test MultiPass

source: Sandbox Password
fr_fr: Mot de passe Test

source: Sandbox Device ID
fr_fr: ID de l'appareil Test

source: Sandbox TSEP Device ID
fr_fr: ID de l'appareil TSEP Test

source: Sandbox Transaction Key
fr_fr: Transaction Key Test

source: Order ID: %s. Order not found.
fr_fr: ID de commande : %s. Commande introuvable.

source: Order ID: %s. Payment method code changed. Expected %s, but found %s
fr_fr: ID de commande : %s. Code de méthode de paiement changé. %s attendu, mais %s trouvé

source: Order ID: %s. Transaction ID changed. Expected %s, but found %s
fr_fr: ID de commande : %s. ID de transaction changé. %s attendu, mais %s trouvé

source: This request method is not supported.
fr_fr: Cette méthode de requête n'est pas prise en charge.

source: Invalid request signature.
fr_fr: Signature de requête invalide.

source: Order ID: %s. Unexpected transaction status on returnUrl: %s
fr_fr: ID de commande : %s. Statut de transaction inattendu de l'UrlRetour : %s

source: Error completing order return with %s. %s %s
fr_fr: Erreur d'exécution de retour de commande avec %s. %s %s

source: Authorized
fr_fr: Autorisé

source: Captured
fr_fr: Capturé

source: Order ID: %s. Unexpected transaction status on statusUrl: %s
fr_fr: ID de commande : %s. Statut de transaction inattendu de l'UrlRetour : %s

source: Error completing order status with %s. %s %s
fr_fr: Erreur d'exécution du statut de commande avec %s. %s %s

source: Payment of %1$s declined/failed. Transaction ID: %2$s
fr_fr: Paiement de %1$s refusé/échoué. ID de transaction : %2$s

source: %1$s payment canceled by customer. Transaction ID: %2$s.
fr_fr: Paiement de %1$s annulé par le client. ID de transaction : %2$s.

source: Error completing order cancel with %s. %s %s
fr_fr: Erreur d'exécution d'annulation de commande avec %s. %s %s

source: Thank you. Your order has been received, but we have encountered an issue when redirecting back. Please contact us for assistance.
fr_fr: Merci. Votre commande a été reçue, mais un problème est survenu lors du réacheminement. Veuillez nous contacter pour de l'assistance.

source: Enable payment method
fr_fr: Activer la méthode de paiement

source: Pay with PayPal
fr_fr: Payer avec PayPal

source: Connect to PayPal via Unified Payments Gateway
fr_fr: Connectez-vous à Paypal via la passerelle Unified Payments

source: %1$s payment initiated with %3$s. Transaction ID: %2$s.
fr_fr: Paiement de %1$s amorcé avec %3$s. ID de transaction : %2$s.

source: %1$s amount of %2$s. Transaction ID: %3$s.
fr_fr: Montant %1$s de %2$s. ID de transaction : %3$s.

source: Authorized amount of %1$s. Transaction ID: %2$s.
fr_fr: Montant autorisé de %1$s. ID de transaction : %2$s.

source: Captured amount of %1$s. Transaction ID: %2$s.
fr_fr: Montant capturé de %1$s. ID de transaction : %2$s.

source: <strong>Billing ZIP Code</strong> is a required field for this payment method.
fr_fr: <strong>Le code postal de facturation</strong> est obligatoire pour cette méthode de paiement.

source: <strong>Shipping ZIP Code</strong> is a required field for this payment method.
fr_fr: <strong>Le code postal de livraison</strong> est obligatoire pour cette méthode de paiement.

source: <strong>Phone</strong> is a required field for this payment method.
fr_fr: <strong>Le téléphone</strong> est obligatoire pour cette méthode de paiement.

source: Pay with Affirm
fr_fr: Payer avec Affirm

source: Connect to Affirm via Unified Payments Gateway
fr_fr: Connectez-vous à Affirm via la passerelle Unified Payments

source: Pay with Clearpay
fr_fr: Payer avec Clearpay

source: Connect to Clearpay via Unified Payments Gateway
fr_fr: Connectez-vous à Clearpay via la passerelle Unified Payments

source: Pay with Klarna
fr_fr: Payer avec Klarna

source: Connect to Klarna via Unified Payments Gateway
fr_fr: Connectez-vous à Klarna via la passerelle Unified Payments

source: Pay with Apple Pay
fr_fr: Payer avec Apple Pay

source: Connect to Apple Pay via Unified Payments Gateway
fr_fr: Connectez-vous à Apple Pay via la passerelle Unified Payments

source: Apple Merchant ID*
fr_fr: ID de marchand Apple*

source: Apple Merchant Cert Path*
fr_fr: Chemin certif de marchand Apple*

source: Apple Merchant Key Path*
fr_fr: Chemin de clé de marchand Apple*

source: Apple Merchant Key Passphrase
fr_fr: Phrase de passe clé de marchand Apple

source: Apple Merchant Domain*
fr_fr: Domaine de marchand Apple*

source: Apple Merchant Display Name*
fr_fr: Nom de marchand Apple affiché*

source: Accepted Cards*
fr_fr: Cartes acceptées

source: Apple button color
fr_fr: Couleur du bouton Apple

source: Button styling at checkout
fr_fr: Style des boutons à la caisse

source: Black
fr_fr: Noir

source: White
fr_fr: Blanc

source: White with Outline
fr_fr: Blanc avec Contour

source: Pay with Click To Pay
fr_fr: Payer avec Click To Pay

source: Connect to Click To Pay via Unified Payments Gateway
fr_fr: Connectez-vous à Click To Pay via la passerelle Unified Payments

source: Click To Pay Client ID*
fr_fr: ID de client Click To Pay*

source: Your Merchant ID provided by Click To Pay.
fr_fr: Votre ID de marchand fourni par Click To Pay.

source: Render Click To Pay natively
fr_fr: Rendre Click To Pay nativement

source: Click To Pay will render natively within the payment form
fr_fr: Click To Pay est rendu nativement dans le formulaire de paiement

source: Accept Canadian Visa debit cards
fr_fr: Accepter les cartes de débit Visa canadiennes

source: Display Global Payments footer
fr_fr: Afficher le bas de page de Global Payments

source: Display Global Payments footer within the payment form
fr_fr: Afficher le bas de page de Global Payments dans le formulaire de paiement

source: Click To Pay Billing
fr_fr: Facturation Click To Pay

source: Email address:
fr_fr: Adresse courriel:

source: Click To Pay Shipping
fr_fr: Livraison Click To Pay

source: Pay with Google Pay
fr_fr: Payer avec Google Pay

source: Connect to Google Pay via Unified Payments Gateway
fr_fr: Connectez-vous à Google Pay via la passerelle Unified Payments

source: Global Payments Client ID*
fr_fr: ID de client Global Payments*

source: Your Client ID provided by Global Payments.
fr_fr: Votre ID de client fourni par Global Payments.

source: Google Merchant ID
fr_fr: ID de marchand Google

source: Your Merchant ID provided by Google.
fr_fr: Votre ID de marchand fourni par Google.

source: Google Merchant Display Name
fr_fr: Nom de marchand Google affiché

source: Displayed to the customer in the Google Pay dialog.
fr_fr: Ce que voit le client dans le dialogue Google Pay.

source: Allowed Card Auth Methods*
fr_fr: Méthodes d'autorisation de carte permises

source: Button Color
fr_fr: Couleur de bouton

source: Bank Payment
fr_fr: Paiements bancaire

source: GlobalPayments - Bank Payment
fr_fr: GlobalPayments - Paiement bancaire

source: Connect to Bank Payments via Unified Payments Gateway
fr_fr: Connectez-vous à Paiements bancaires via la passerelle Unified Payments

source: Account Number
fr_fr: Numéro de compte

source: Account number, for bank transfers within the UK (UK to UK bank). Only required if no bank details are stored on account.
fr_fr: Numéro de compte, pour les transferts bancaires au R.-U. (R.-U. à banque R.-U.). Requis seulement si aucune donnée bancaire n'est stockée dans le compte.

source: Account Name
fr_fr: Nom du compte

source: The name of the individual or business on the bank account. Only required if no bank details are stored on account.
fr_fr: Le nom de la personne ou de l'entreprise liée au compte bancaire. Requis seulement si aucune donnée bancaire n'est stockée dans le compte.

source: Only required for EUR transacting merchants.
fr_fr: Uniquement requis pour les commerçants effectuant des transactions en EUR.

source: Sort Code
fr_fr: Code bancaire

source: Six digits which identify the bank and branch of an account. Included with the Account Number for UK to UK bank transfers. Only required if no bank details are stored on account.
fr_fr: Six chiffres qui identifient la banque et la succursale d'un compte. Accompagne le numéro de compte pour les transferts bancaires R.-U. à banque R.-U. Requis seulement si aucune donnée bancaire n'est stockée dans le compte.

source: Countries
fr_fr: Pays
