Repository: terrylinwkMGS/Global-payment-source-code-tiral
Catalog: languages/globalpayments-gateway-provider-for-woocommerce-*.po
Languages: fr_fr

source: Currencies*
fr_fr: Devises*

source: Note: The payment method will be displayed at checkout only for the selected currencies.
fr_fr: Remarque : La méthode de paiement sera affichée à la caisse seulement pour les devises sélectionnées.

source: Your payment was unsuccessful. Please try again or use a different payment method.
fr_fr: Votre paiement a échoué. Veuillez réessayer ou utiliser une autre méthode de paiement.

source: An error occurred while processing the payment. Please try again or use a different payment method.
fr_fr: Une erreur est survenue lors du traitement du paiement. Veuillez réessayer ou utiliser une autre méthode de paiement.

source: Specify which account to use when processing a transaction. Default account will be used if this is not specified.
fr_fr: Spécifiez quel compte utiliser lorsque vous traitez une transaction. Compte défaut serait utilisé si pas spécifiée.

source: Sandbox Account Name
fr_fr: Nom de compte Test

source: PAN_ONLY: This authentication method is associated with payment cards stored on file with the user's Google Account. CRYPTOGRAM_3DS: This authentication method is associated with cards stored as Android device tokens. PAN_ONLY can expose the FPAN, which requires an additional SCA step up to a 3DS check. Currently, Global Payments does not support the Google Pay SCA challenge with an FPAN. For the best acceptance, we recommend that you provide only the CRYPTOGRAM_3DS option.
fr_fr: PAN_SEULEMENT : Cette méthode d'authentification est associée aux cartes de paiement sauvegardées dans le compte Google de l'utilisateur. CRYPTOGRAMME_3DS : Cette méthode d'authentification est associée aux cartes stockées sous forme de jetons d'appareil Android. PAN_SEULEMENT peut exposer le FPAN, qui requiert une étape de sécurité additionnelle à la vérification 3DS. Actuellement, Global Payments ne prend pas en charge cette étape de sécurité Google Pay avec un FPAN. Pour optimiser l'acceptation, nous vous recommandons de n'offrir que l'option CRYPTOGRAMME_3DS.

source: Allows you to input a COUNTRY or string of COUNTRIES to limit what is shown to the customer. Including a country overrides your default account configuration. <br/><br/> Format: List of ISO 3166-2 (two characters) codes separated by a | <br/><br/> Example: FR|GB|IE
fr_fr: Vous permet de saisir un PAYS ou une chaîne de PAYS en vue de limiter ce qui est montré au client. L'ajout d'un pays annule votre configuration de compte par défaut. <br/><br/> Format : Liste de codes ISO 3166-2 (deux caractères) séparés par un | <br/><br/> Exemple : FR|GB|IE
